Repository: MarkTseng/mySampleCode
Catalog: memory_leak_check/memprof-0.6.2/po/*.po
Languages: el, et, ja, nl, pt, ru, tr

source: Cannot open output file: %s
el: Αδυναμία ανοίγματος αρχείου εξόδου: %s
et: Ei suuda avada väljundfaili: %s
ja: 出力ファイルが開きません: %s
nl: Kan uitvoerbestand '%s' niet openen
pt: Incapaz de abrir ficheiro de saida: %s
ru: Невозможно открыть файл вывода: %s
tr: Çıktı dosyası açılamadı: %s

source: Executation of "%s" failed
el: Αποτυχία εκτέλεσης του "%s"
et: "%s" käivitamine ebaõnnestus
ja: "%s" が実行できません
nl: Uitvoering van "%s" mislukt
pt: Falhou a execução de "%s"
ru: Выполнение "%s" не удалось
tr: "%s" çalıştırılması başarısız oldu

source: Cannot find executable for "%s"
el: Δε μπορεί να βρεθεί το εκτελέσιμο "%s"
et: Ei leia "%s" programmifaili
ja: 実行ファイルが見つかりません: %s
nl: Kan uitvoerbaar bestand for "%s" niet vinden
pt: Incapaz de encontrar executável de "%s"
ru: Невозможно найти исполняемую программу для "%s"
tr: "%s" için çalıştırılabilir şey bulamadım

source: Saving is disabled at the moment
el: Η αποθήκευση είναι προς το παρόν ανενεργ'η
ja: 保存機能は現在無効になっています
nl: Opslaan is momenteel uitgezet
pt: De momento gravar está desabilitado
ru: В настоящий момент сохранение отключено
tr: Kaydetme şu an için etkin değil

source: MemProf Error
el: Σφάλμα MemProf
et: MemProf viga
ja: MemProf エラー
nl: MemProf fout
pt: Erro MemProf
ru: Ошибка MemProf
tr: MemProf Hatası

source: MemProf Warning
el: Προειδοποίηση MemProf
et: MemProf hoiatus
ja: MemProf 警告
nl: MemProf waarschuwing
pt: Aviso MemProf
ru: Предупреждение MemProf
tr: MemProf Uyarısı

source: Name
el: Όνομα
ja: 名前
nl: Naam
pt: Nome
ru: Название
tr: İsim

source: Self
el: Εαυτός
ja: 自己
nl: Zelf
pt: Próprio
ru: Сама
tr: Kendisi

source: Total
el: Σύνολο
ja: 合計
nl: Totaal
ru: Итого
tr: Toplam

source: Cumulative
ja: 累積
nl: Cumulatief
pt: Cumulativo
ru: Накоплено
tr: Toplam

source: Address
el: Διεύθυνση
et: Aadress
ja: アドレス
nl: Adres
pt: Endereço
ru: Адрес
tr: Adres

source: Size
el: Μέγεθος
et: Suurus
ja: サイズ
nl: Grootte
pt: Tamanho
ru: Размер
tr: Boyut

source: Caller
el: Γονική διεργασία
et: Kutsuja
ja: 呼び出し元
nl: Aanroeper
pt: Invocador
ru: Вызывающая
tr: Çağırıcı

source: Function
el: Συνάρτηση
et: Funktsioon
ja: 関数
nl: Functie
pt: Função
ru: Функция
tr: Işlem

source: Line
el: Γραμμή
et: Rida
ja: 行
nl: Regel
pt: Linha
ru: Строка
tr: Satır

source: File
el: Αρχείο
et: Fail
ja: ファイル
nl: Bestand
pt: Ficheiro
ru: Файл
tr: Dosya

source: Really detach from finished process?
el: Θέλετε πραγματικά να αποσυνδεθείτε από την τερματισμένη διεργασία;
et: Kas haakida lõpetatud protsessist lahti?
ja: 終了したプロセスを切り離してよろしいですか?
nl: Echt ontkoppelen van voltooid proces?
pt: Desligar mesmo de processo terminado?
ru: Отсоединить от завершенного процесса?
tr: Sonlanan süreçten gerçekten ayrılsın mı?

source: Really detach from running process?
el: Θέλετε πραγματικά να αποσυνδεθείτε από την εκτελούμενη διεργασία;
et: Kas haakida töötavast protsessist lahti?
ja: 実行中のプロセスを切り離してよろしいですか?
nl: Echt ontkoppelen van lopend proces?
pt: Desligar mesmo de processo em execução?
ru: Отсоединить от запущенного процесса?
tr: Çalışan süreçten gerçekten ayrılsın mı?

source: Really kill running process?
el: Θέλετε πραγματικά να σκοτώσετε την εκτελούμενη διεργασία;
et: Kas tõesti tappa töötav protsess?
ja: 実行中のプロセスを強制終了してよろしいですか?
nl: Lopend proces echt afsluiten?
pt: Matar mesmo processo em execução?
ru: Уничтожить запущенный процесс?
tr: Çalışan işlem gerçekten kapatılsın mı?

source: Create new windows for forked processes
el: Δημιουργία νέων παραθύρων για τις δικρανωμένες διεργασίες
et: Loo forgitud protsessidele uued aknad
ja: forkされたプロセスの新規ウィンドウを作成
nl: Maak nieuw venster voor geforkte processen
pt: Criar novas janelas para processos forked
ru: Создать новое окно для порожденного процесса
tr: Çatallanan işlemler için yeni pencereler oluştur

source: Retain windows for processes after exec()
el: Διατήρηση παραθύρων για διεργασίες μετά από exec()
et: Säilita peale exec() käsku programmiaknad
ja: exec()後のプロセスのウィンドウの保持
nl: Behoud vensters voor processen na exec()
pt: Reter janelas para processos após exec()
ru: Сохранять окна для процессов после exec()
tr: exec() işlemleri sonrası pencereleri kapatma

source: Type of profiling information to collect
ja: 修正すべきプロファイリング情報の型
nl: Het soort profileringsinformatie dat wordt verzameld
pt: Tipo de informação de perfil a reunir
ru: Тип собираемой информации для профилирования
tr: Toplanacak profil bilgilerinin türü

source: Number of samples/sec for time profile (1k=1000)
el: Αριθμός δειγμάτων ανά δευτερόλεπτο για time profile (1k=1000)
ja: 時間プロファイルで使用する毎秒のサンプル数 (1k=1000)
nl: Het aantal samples/sec voor het tijdprofiel (1k=1000)
pt: Número de amostras/seg para tempo de perfil (1k=1000)
ru: Число образцов в секунду для профилирования времени (1k=1000)
tr: Zaman profili için saniye başına örnek sayısı (1k=1000)

source: Argument of --profile must be one of 'memory', 'cycles, or 'time'
ja: --profile の引数は、'memory', 'cycle', 'time' のうちのいずれかでなければなりません
pt: Argumento de --profile tem de ser 'memomy', 'cycles' ou 'time'
tr: --profile için parametreler 'memory', 'cycles' veya 'time'dan biri olmalıdır

source: Cannot find memprof.glade
el: Αδυναμία εύρεσης του memprof.glade
ja: memprof.glade が見つかりません
nl: Kan memprof.glade niet vinden
pt: Incapaz de encontrar memprof.glade
ru: Не удалось найти файл memprof.glade
tr: memprof.glade bulunamadı

source: # of Allocations:
el: # από Εκχωρήσεις:
et: Allokatsioonide arv:
ja: アロケーション数:
nl: Aantal Allocaties:
pt: Nº de Alocações:
ru: Число распределений:
tr: Ayırmaların sayısı:

source: 0k
ja: OK
nl: Ok

source: <b>Callers</b>
ja: <b>呼び出し元</b>
nl: <b>Aanroepers</b>
pt: <b>Invocadores</b>
ru: <b>Вызывающие</b>
tr: <b>Çağırıcılar</b>

source: <b>Descendants</b>
ja: <b>子</b>
nl: <b>Afstammelingen</b>
pt: <b>Descendentes</b>
ru: <b>Вызываемые</b>
tr: <b>Alt süreçler</b>

source: Adding Skip Function
el: Προσθήκη Συνάρτησης προς Παράκαμψη
et: Vahelejäetava funktsiooni lisamine
ja: スキップする関数の追加
nl: Functie overslaan wordt toegevoegd
pt: A Adicionar Função Ignorar
ru: Добавить функцию пропуска
tr: Atlama İşlemi Ekleniyor

source: Adding Skip Regular Expression
el: Προσθήκη Κανονικής Έκφρασης προς Παράκαμψη
et: Vahelejäetava regulaaravaldise lisamine
ja: スキップする正規表現の追加
nl: Reguliere Expressie overslaan wordt toegevoegd
pt: A Adicionar Ignorar de Expressão Regular
ru: Добавить регулярное выражение для пропуска
tr: Düzenli İfadeleri Atlama Ekleniyor

source: Bytes / Allocation:
el: Bytes / Εκχώρηση:
et: Baiti / allokatsioon:
ja: バイト数 / アロケーション:
nl: Byte / Allocatie:
pt: Bytes / Alocação:
ru: Байт / Распределение:
tr: Bayt / Ayırma:

source: Check for Leaks
el: Έλεγχος για Διαρροές
et: Otsi lekkeid
ja: リークのチェック
nl: Op lekken controleren
pt: Verificar Leaks
ru: Проверка утечек
tr: Sızıntı için Denetim

source: Command to run on double click in stack trace:
el: Εντολή προς εκτέλεση κατά το διπλό κλικ στην παρακολούθηση στοίβας:
et: Käsk, mis käivitada topeltklõpsu peale pinu sisul:
ja: スタックトレース中のダブルクリックで実行するコマンド:
nl: Uit te voeren opdracht na een dubbelklik in "stack volgen":
pt: Comando a executar no duplo-clique do trace da pilha:
ru: Команда для запуска по двойному щелчку в трассировке стека:
tr: Yığın taramasına çift tıklandığında çalıştırılacak komut:

source: Create Profile
el: Δημιουργία Κατατομής
et: Loo profiil
ja: プロファイルの生成
nl: Profiel maken
pt: Criar Perfil
ru: Создать профиль
tr: Profil Oluştur

source: Defaults
el: Εξ' ορισμού
et: Vaikimisi
ja: デフォルト
nl: Standaardwaarden
pt: Omissões
ru: По умолчанию
tr: Öntanımlılar

source: Enter a regular expression of function names to skip when computing profiles
el: Εισάγετε μια κανονική έκφραση για ονόματα συναρτήσεων για να παραμφθούν κατά τον υπολογισμό της κατατόμησης
ja: プロファイルを作成する時にスキップする関数名の正規表現を入力してください
nl: Vul een reguliere expressie of functienaam in om over te slaan wanneer profielen worden berekend
pt: Introduza uma expressão regular ou nomes de funções a ignorar ao calcular perfis
ru: Введите регулярное выражение имен функций пропускаемых при вычислении профилей
tr: Profiller hesaplanırken atlanacak işlem isimlerinin düzenli ifadelerini girin

source: Enter pathname to an executable
el: Εισαγωγή της διαδρομής για ένα εκτελέσιμο
ja: 実行ファイルのパス名を入力して下さい
nl: Het pad naar een uitvoerbaar bestand invoeren
pt: Introduza caminho para um executável
ru: Введите путь к исполняемой программе
tr: Çalıştırılabilir dosya için yoladı girin

source: Enter the name of a function to skip when computing profiles
el: Εισάγετε το όνομα της συνάρτησης για παράκαμψη κατά τον υπολογισμό των κατατομών
ja: プロファイル取得時にスキップする関数名を入力して下さい
nl: Geef de naam van een functie om over te slaan bij het berekenen van profielen
pt: Introduza o nome de uma função a ignorar ao calcular perfis
ru: Введите название функции пропускаемой при вычислении профиля
tr: Profiller hesaplanırken atlanacak işlemin adını girin

source: Follow _exec()
el: Ακολούθηση των _exec()
et: Järgne _exec() käsule
ja: exec()を追いかける(_E)
nl: _exec() volgen
pt: Seguir _exec()
ru: Отследить exec()
tr: _exec()'i takip et

source: Follow _fork()
el: Ακολούθηση των _fork()
et: Järgne _fork() käsule
ja: fork()を追いかける(_F)
nl: _fork() volgen
pt: Seguir _fork()
ru: Отследить fork()
tr: _fork()'u takip et

source: Functions to Skip:
el: Συναρτήσεις προς Παράκαμψη:
et: Funktsioonid, mis vahele jätta:
ja: スキップする関数:
nl: Functies overslaan:
pt: Funções a Ignorar:
ru: Функции для пропуска:
tr: Atlatılınacak İşlemler:

source: Generate _Leak Report
el: Παραγωγή Αναφοράς _Διαρροών
et: Genereeri _lekkearuanne
ja: リーク情報の生成(_L)
nl: _Lekrapport genereren
pt: Gerar Relatório _Leak
ru: Генерация информации об утечке
tr: _Sızıntı Raporu Oluştur

source: Generate _Profile
el: Δημιουργία _Κατατόμησης
et: Genereeri _profiil
ja: プロファイルの生成(_P)
nl: _Profiel genereren
pt: Gerar _Perfil
ru: Генерация профиля
tr: Profil _Oluştur

source: Kill
el: Σκότωμα
et: Tapa
ja: 強制終了
nl: Afsluiten
pt: Matar
ru: Уничтожить
tr: Kapat

source: Kill Program
el: Βιαίος τερματισμός προγράμματος
et: Tapa programm
ja: プログラムの強制終了
nl: Programma afsluiten
pt: Matar Aplicação
ru: Уничтожить программу
tr: Programı Kapat

source: Leak Detection Options
el: Επιλογές Ανίχνευσης Στοίβας
et: Lekete avastamise häälestus
ja: リーク検出オプション
nl: Lekdetectie-opties
pt: Opções Detecção Leak
ru: Параметры засечки утечек
tr: Sızıntı Tanıma Seçenekleri

source: Leaks
el: Διαρροές
et: Lekked
ja: リーク
nl: Lekken
ru: Утечки
tr: Sızıntılar

source: MemProf - Processes
el: MemProf - Διεργασίες
et: Memprof - protsessid
ja: MemProf エラー
nl: MemProf - Processen
pt: MemProf - Processos
ru: MemProf - Процессы
tr: MemProf - Süreçler

source: Memory Profiling Tool
el: Εργαλείο Κατατόμησης Μνήμης
et: Mälu profileerimise tööriist
ja: メモリプロファイリングツール
nl: Geheugen Profiel Hulpmiddel
pt: Ferramenta de Verificação Memória
ru: Инструмент профилирования памяти
tr: Bellek Profili Aracı

source: Preferences
el: Προτιμήσεις
et: Häälestus
ja: 設定
nl: Voorkeuren
pt: Preferências
ru: Настройки
tr: Tercihler

source: Process _Tree
el: _Δέντρο Διεργασιών
et: Protsessi_puu
ja: プロセスツリー(_T)
nl: Proces-_boom
pt: Ár_vore Processo
ru: Дерево процесса
tr: Süreç _Ağacı

source: Profile
el: Κατατομή
et: Profiil
ja: プロファイル
nl: Profiel
pt: Perfil
ru: Профиль
tr: Profil

source: Profile Options
el: Επιλογές Κατατόμησης
et: Profiili häälestus
ja: プロファイルオプション
nl: Profiel-opties
pt: Opções Perfil
ru: Параметры профиля
tr: Profil Seçenekeleri

source: Regular expressions to Skip:
el: Κανονικές εκφράσεις προς Παράκαμψη:
et: Regulaaravaldised, mis vahele jätta:
ja: スキップする正規表現:
nl: Reguliere expressie overslaan:
pt: Expressões regulares a Ignorar:
ru: Регулярные выражения для пропуска:
tr: Atlanacak düzenli ifadeler:

source: Reset
el: Επαναφορά
ja: リセット
nl: Resetten
pt: Reiniciar
ru: Сброс
tr: Sıfırlar

source: Run
el: Εκτέλεση
et: Käivita
ja: 実行
nl: Uitvoeren
pt: Executar
ru: Запустить
tr: Çalıştır

source: Run Executable
el: Εκτέλεση Εκτελέσιμου
et: Käivita programmifail
ja: 実行ファイルの実行
nl: Uitvoerbaar bestand starten
pt: Executar Binários
ru: Запустить исполняемую программу
tr: Çalıştırılabilir Dosyayı Başlat

source: Run Program
el: Εκτέλεση Προγράμματος
et: Käivita programm
ja: プログラムの実行
nl: Programma uitvoeren
pt: Executar Aplicação
ru: Запуск программы
tr: Programı Çalıştır

source: Save
el: Αποθήκευση
et: Salvesta
ja: 保存
nl: Opslaan
pt: Gravar
ru: Сохранить
tr: Kaydet

source: Save Report
el: Αποθήκευση Αναφοράς
et: Salvesta aruanne
ja: ファイルの保存
nl: Rapport opslaan
pt: Gravar Relatório
ru: Сохранить отчет
tr: Bildirimi Kaydet

source: Save _Leak Info...
el: Αποθήκευση Πληροφοριών _Διαρροής...
et: Salvesta _lekkeinfo...
ja: リーク情報の保存(_L)...
nl: _Lek-informatie opslaan...
pt: Gravar Info _Leak...
ru: Сохранение информации об утечке...
tr: _Sızıntı Bilgisini Kaydet...

source: Save _Profile...
el: Αποθήκευση _Κατατόμησης...
et: Salvesta _profiil...
ja: プロファイルの保存(_P)...
nl: _Profiel opslaan...
pt: Gravar _Perfil...
ru: Сохранение профиля...
tr: _Profili Kaydet...

source: Stack Trace
el: Παρακολούθηση Στοίβας
et: Pinu sisu
ja: スタックトレース
nl: Stack volgen
pt: Trace Pilha
ru: Трассировка стека
tr: Yığın Taraması

source: Total Bytes:
el: Συνολικά Bytes:
et: Baite kokku:
ja: 合計バイト数:
nl: Totaal aantal Byte:
pt: Bytes Totais:
ru: Всего байт:
tr: Toplam Bayt:

source: _Detach
el: _Αποσύνδεση
et: _Haagi lahti
ja: 切り離し(_D)
nl: _Losmaken
pt: _Desligar
ru: Отделить
tr: _Ayır

source: _File
el: Αρ_χείο
ja: ファイル(_F)
nl: _Bestand
pt: _Ficheiro
ru: Файл
tr: _Dosya

source: _Help
el: _Βοήθεια
ja: ヘルプ(_H)
nl: _Hulp
pt: _Ajuda
ru: Справка
tr: _Yardım

source: _Kill
el: _Σκότωμα
et: _Tapa
ja: 強制終了(_K)
nl: _Afsluiten
pt: _Matar
ru: Уничтожить
tr: _Kapat

source: _Process
el: _Διεργασία
et: _Protsess
ja: プロセス(_P)
nl: _Proces
pt: _Processo
ru: Процесс
tr: _Süreç

source: _Run Program...
el: Ε_κτέλεση Προγράμματος...
ja: プログラムの実行(_R)...
nl: Programma _uitvoeren...
pt: E_xecutar Aplicação...
ru: Запуск программы...
tr: _Uygulamayı Çalıştır

source: _Settings
el: _Ρυθμίσεις
ja: 設定(_S)
nl: _Instellingen
pt: _Definições
ru: Установки
tr: Aya_rlar

source: translator_credits
el: Σίμος Ξενιτέλλης <simos74@gmx.net>
ja: Riue. SATOH <riue@gnome.gr.jp>, 1999. 中井 幸博 <nakai@gnome.gr.jp>, 2000, 2004. KAMAGASAKO Masatoshi <emerald@gnome.gr.jp>, 2003
nl: Vincent van Adrighem
pt: Duarte Loreto <happyguy_pt@hotmail.com>
ru: Валёк Филиппов <frob at df dot ru>
tr: Barış Çiçek <baris@teamforce.name.tr>

source: Initial
el: Αρχικό
et: Algne
ja: 初期
nl: Begin
pt: Inicial
ru: Начало
tr: Başlangıç

source: Starting
el: Προς εκκίνηση
et: Alustav
ja: 開始
nl: Startend
pt: A Iniciar
ru: Запуск
tr: Başlıyor

source: Running
el: Σε εκτέλεση
et: Töötav
ja: 実行
nl: Lopend
pt: Em Execução
ru: Выполнение
tr: Çalışıyor

source: Exiting
el: Σε τερματισμό
et: Lõpetav
ja: 終了
nl: Stoppend
pt: A Terminar
ru: Выход
tr: Çıkılıyor

source: Defunct
el: Εκλιπών
ja: ゾンビ
nl: Afgelopen
pt: Morto
ru: Завершён
tr: Çalışmayan

source: Cannot find %s
el: Αδυναμία εύρεσης %s
ja: %s が見つかりません
nl: Kan %s niet vinden
pt: Incapaz de encontrar %s
ru: Невозможно найти %s
tr: %s bulunamadı

source: Show
el: Εμφάνιση
et: Näita
ja: 表示する
nl: Weergeven
pt: Mostrar
ru: Показать
tr: Göster

source: Hide
el: Απόκρυψη
et: Peida
ja: 表示しない
nl: Verbergen
pt: Esconder
ru: Скрыть
tr: Gizle

source: Detach
el: Απόσπαση
et: Haagi lahti
ja: 切り離し
nl: Ontkoppelen
pt: Desligar
ru: Отделить
tr: Ayır

source: PID
el: ΤΑΥΤΔΙΕΡΓ
ja: プロセスID

source: Command Line
el: Γραμμή Εντολών
et: Käsurida
ja: コマンドライン
nl: Opdrachtregel
pt: Linha Comando
ru: Командная строка
tr: Komut Satırı

source: Status
el: Κατάσταση
et: Olek
ja: 状態
pt: Estado
ru: Состояние
tr: Durum

source: Argument of --profile must be one of 'memory', 'cycles', or 'time'
nl: Het argument van --profile moet zijn: 'memory', 'cycles' of 'time'
ru: Аргументом --profile должен быть один из "memory", "cycles" или "time"

source: Copyright 1999, 2000, 2001, Red Hat, Inc. Copyright 2002, Kristian Rietveld
el: Πνευματικά δικαιώματα 1999, 2000, 2001, Red Hat, Inc. Πνευματικά δικαιώματα 2002, Kristian Rietveld
ru: (С) 1999-2001, Red Hat, Inc. (С) 2002, Kristian Rietveld
tr: Telif Hakkı 1999, 2000, 2001, Red Hat, Inc. Telif Hakkı 2002, Kristian Rietveld

source: Really quit MemProf?
et: Kas lõpetada Memprofi töö?
